<?php

use Illuminate\Database\Seeder;

class CategoriesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('categories')->insert([
            ['id' => '1', 'namerus' => 'Мир, природа', 'nameeng' => ''],
            ['id' => '2', 'namerus' => 'Растения, минералы, вещества', 'nameeng' => ''],
            ['id' => '3', 'namerus' => 'Животные', 'nameeng' => ''],
            ['id' => '4', 'namerus' => 'Организм животных и человека', 'nameeng' => ''],
            ['id' => '5', 'namerus' => 'Здоровье, болезнь', 'nameeng' => ''],
            ['id' => '6', 'namerus' => 'Жизнь, смерть', 'nameeng' => ''],
            ['id' => '7', 'namerus' => 'Судьба, удача, несчастье', 'nameeng' => ''],
            ['id' => '8', 'namerus' => 'Дом', 'nameeng' => ''],
            ['id' => '9', 'namerus' => 'Еда', 'nameeng' => ''],
            ['id' => '10', 'namerus' => 'Одежда, внешний вид', 'nameeng' => ''],
            ['id' => '11', 'namerus' => 'Предметы обихода', 'nameeng' => ''],
            ['id' => '12', 'namerus' => 'Материалы, детали предметов', 'nameeng' => ''],
            ['id' => '13', 'namerus' => 'Семья, родственники, возраст', 'nameeng' => ''],
            ['id' => '14', 'namerus' => 'Любовь, секс, отношения', 'nameeng' => ''],
            ['id' => '15', 'namerus' => 'Вражда, противостояние', 'nameeng' => ''],
            ['id' => '16', 'namerus' => 'Дружба, доверие, уважение', 'nameeng' => ''],
            ['id' => '17', 'namerus' => 'Сотрудничество, руководство, подчинение', 'nameeng' => ''],
            ['id' => '18', 'namerus' => 'Ум, глупость', 'nameeng' => ''],
            ['id' => '19', 'namerus' => 'Знание, понимание, уверенность', 'nameeng' => ''],
            ['id' => '20', 'namerus' => 'Мышление', 'nameeng' => ''],
            ['id' => '21', 'namerus' => 'Ожидание, воображение, воспоминание', 'nameeng' => ''],
            ['id' => '22', 'namerus' => 'Наблюдение, восприятие', 'nameeng' => ''],
            ['id' => '23', 'namerus' => 'Свет, звук, запах, вкус', 'nameeng' => ''],
            ['id' => '24', 'namerus' => 'Спокойствие, волнение', 'nameeng' => ''],
            ['id' => '25', 'namerus' => 'Желание, любовь', 'nameeng' => ''],
            ['id' => '26', 'namerus' => 'Страх, ненависть, горе', 'nameeng' => ''],
            ['id' => '27', 'namerus' => 'Субъективные качества', 'nameeng' => ''],
            ['id' => '28', 'namerus' => 'Свойства характера', 'nameeng' => ''],
            ['id' => '29', 'namerus' => 'Нравственные оценки', 'nameeng' => ''],
            ['id' => '30', 'namerus' => 'Общение, разговор', 'nameeng' => ''],
            ['id' => '31', 'namerus' => 'Дискуссия, переговоры', 'nameeng' => ''],
            ['id' => '32', 'namerus' => 'Одобрение, осуждение, репутация', 'nameeng' => ''],
            ['id' => '33', 'namerus' => 'Разрешение, призыв, совет', 'nameeng' => ''],
            ['id' => '34', 'namerus' => 'Правда, ложь, верность, обман', 'nameeng' => ''],
            ['id' => '35', 'namerus' => 'Информация, текст, документ', 'nameeng' => ''],
            ['id' => '36', 'namerus' => 'Искусство, литература, СМИ', 'nameeng' => ''],
            ['id' => '37', 'namerus' => 'Цель, попытка, результат', 'nameeng' => ''],
            ['id' => '38', 'namerus' => 'Описание деятельности', 'nameeng' => ''],
            ['id' => '39', 'namerus' => 'Рабочий процесс', 'nameeng' => ''],
            ['id' => '40', 'namerus' => 'Способности, ресурсы, средства', 'nameeng' => ''],
            ['id' => '41', 'namerus' => 'Намерение, решение, выбор', 'nameeng' => ''],
            ['id' => '42', 'namerus' => 'Физический труд', 'nameeng' => ''],
            ['id' => '43', 'namerus' => 'Развлечения, отдых', 'nameeng' => ''],
            ['id' => '44', 'namerus' => 'Собственность, обретение, потеря', 'nameeng' => ''],
            ['id' => '45', 'namerus' => 'Богатство, бедность, деньги', 'nameeng' => ''],
            ['id' => '46', 'namerus' => 'Трудовые отношения', 'nameeng' => ''],
            ['id' => '47', 'namerus' => 'Экономика', 'nameeng' => ''],
            ['id' => '48', 'namerus' => 'Сельское хозяйство', 'nameeng' => ''],
            ['id' => '49', 'namerus' => 'Политика, общество', 'nameeng' => ''],
            ['id' => '50', 'namerus' => 'Война, оружие', 'nameeng' => ''],
            ['id' => '51', 'namerus' => 'Криминал, закон', 'nameeng' => ''],
            ['id' => '52', 'namerus' => 'Религия, мифология', 'nameeng' => ''],
            ['id' => '53', 'namerus' => 'Город, местность', 'nameeng' => ''],
            ['id' => '54', 'namerus' => 'Путешествие, транспорт', 'nameeng' => ''],
            ['id' => '55', 'namerus' => 'Образование, наука, техника', 'nameeng' => ''],
            ['id' => '56', 'namerus' => 'Размер, вес, объём', 'nameeng' => ''],
            ['id' => '57', 'namerus' => 'Сила, интенсивность', 'nameeng' => ''],
            ['id' => '58', 'namerus' => 'Количество, доля', 'nameeng' => ''],
            ['id' => '59', 'namerus' => 'Избыток, недостаток, норма', 'nameeng' => ''],
            ['id' => '60', 'namerus' => 'Время', 'nameeng' => ''],
            ['id' => '61', 'namerus' => 'Расположение, последовательность', 'nameeng' => ''],
            ['id' => '62', 'namerus' => 'Форма, часть', 'nameeng' => ''],
            ['id' => '63', 'namerus' => 'Перемещение, движение', 'nameeng' => ''],
            ['id' => '64', 'namerus' => 'Сущность, смысл, свойство', 'nameeng' => ''],
            ['id' => '65', 'namerus' => 'Сходство, различие, редкость, распространённость', 'nameeng' => ''],
            ['id' => '66', 'namerus' => 'Отношение, соединение, состав', 'nameeng' => ''],
            ['id' => '67', 'namerus' => 'Появление, исчезновение', 'nameeng' => ''],
            ['id' => '68', 'namerus' => 'Изменение, сохранение', 'nameeng' => ''],
            ['id' => '69', 'namerus' => 'Влияние, воздействие', 'nameeng' => ''],
            ['id' => '70', 'namerus' => 'Событие, причина и следствие', 'nameeng' => ''],
            ['id' => '71', 'namerus' => 'Важность, нужность, полезность', 'nameeng' => ''],
            ['id' => '72', 'namerus' => 'Физические действия', 'nameeng' => ''],
            ['id' => '73', 'namerus' => 'Физические процессы', 'nameeng' => ''],
            ['id' => '74', 'namerus' => 'Физические характеристики и состояния', 'nameeng' => ''],
            ['id' => '75', 'namerus' => 'Наречия, местоимения и др.', 'nameeng' => ''],
            ['id' => '76', 'namerus' => 'Неклассифицированное', 'nameeng' => '']
        ]);
    }
}
